let score = 5;
let q1 = ["Вопрос 1: Столица Франции - это?", 
    "\n1 - Багдад",
    "\n2 - Париж",
    "\n3 - Токио",
    "\n4 - Сидней"];

let q2 = ["Сколько звезд на флаге США?", 
	"\n1 - 40", 
	"\n2 - 50",
	"\n3 - 23",
	"\n4 - 49"];

let q3 =["Что из этого написал Пушкин?", 	
    "\n1 - Преступление и наказание",
    "\n2 - Гарри Поттер",
    "\n3 - Потрет Дориана Грея",
    "\n4 - Евгений Онегин"]    

let q4 = ["Что из перечисленного пирог?", 
	"\n1 - кулебяка",
	"\n2 - забияка", 
	"\n3 - букуяка", 
	"\n4 - валяка"];

let q5 = ["Кто был первым президентом СССР?",
    "\n1 - Ленин",
    "\n2 - Сталин",
    "\n3 - Горбачев",
    "\n4 - Хрущев"]

let question = [q1, q2, q3, q4, q5];    
let answer = [2, 2, 4, 1, 3];

for(let i = 0; i < question.length && i < answer.length; i ++){
    console.log(question[i]);
    let temp = +prompt();
    let lemp = answer[i];

    if(temp == lemp){
        console.log("Правильно!")
        core = score + 1; 
    }
    if(temp !== lemp){
        console.log("Неверно")
        score = score - 1;
    }
}
console.log("Ваш счет: " + score + "из 5");


            